The surface must have at least three distinct Points.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NotEnoughPointsInSurface { get; }
  Visual Basic
Public Shared ReadOnly Property NotEnoughPointsInSurface As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NotEnoughPointsInSurface {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace